# 1587. Bank Account Summary II
[問題](https://leetcode.com/problems/bank-account-summary-ii/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
joinしてグルーピングして、合計を出す。

In [1]:
import pandas as pd

In [2]:
data = [[900001, 'Alice'], [900002, 'Bob'], [900003, 'Charlie']]
users = pd.DataFrame(data, columns=['account', 'name']).astype({'account':'Int64', 'name':'object'})
data = [[1, 900001, 7000, '2020-08-01'], [2, 900001, 7000, '2020-09-01'], [3, 900001, -3000, '2020-09-02'], [4, 900002, 1000, '2020-09-12'], [5, 900003, 6000, '2020-08-07'], [6, 900003, 6000, '2020-09-07'], [7, 900003, -4000, '2020-09-11']]
transactions = pd.DataFrame(data, columns=['trans_id', 'account', 'amount', 'transacted_on']).astype({'trans_id':'Int64', 'account':'Int64', 'amount':'Int64', 'transacted_on':'datetime64[ns]'})

In [3]:
users

   account     name
0   900001    Alice
1   900002      Bob
2   900003  Charlie

In [4]:
transactions

   trans_id  account  amount transacted_on
0         1   900001    7000    2020-08-01
1         2   900001    7000    2020-09-01
2         3   900001   -3000    2020-09-02
3         4   900002    1000    2020-09-12
4         5   900003    6000    2020-08-07
5         6   900003    6000    2020-09-07
6         7   900003   -4000    2020-09-11

In [22]:
def account_summary(users: pd.DataFrame, transactions: pd.DataFrame) -> pd.DataFrame:
    grouped = transactions.groupby("account")["amount"].sum().reset_index()
    result = grouped.merge(users, on="account", how="inner")
    result = result.rename({"amount": "balance"}, axis=1)
    result = result[result["balance"] > 10000]
    return result[["name", "balance"]]

In [23]:
account_summary(users, transactions)

    name  balance
0  Alice    11000

## Test scripts

In [9]:
grouped = transactions.groupby("account")["amount"].sum().reset_index()

In [10]:
grouped

   account  amount
0   900001   11000
1   900002    1000
2   900003    8000

In [12]:
result = grouped.merge(users, on="account", how="inner")

In [13]:
result

   account  amount     name
0   900001   11000    Alice
1   900002    1000      Bob
2   900003    8000  Charlie

In [14]:
result = result.rename({"amount": "balance"}, axis=1)

In [18]:
result = result[result["balance"] > 10000]

In [19]:
result[["name", "balance"]]

    name  balance
0  Alice    11000